{
  "title": "Thompson Boiler Works",
  "nav": {
    "about": "About",
    "services": "Services",
    "projects": "Projects",
    "careers": "Careers",
    "contact": "Contact"
  },
  "landing": {
    "subtitle": "Your welding solutions for all industries",
    "divider": "Where no project is too complex",
    "about": {
      "title": "Who are we?",
      "body": "A multi-service welding company that provides innovative, custom solutions for a wide array of industrial, commercial, and agricultural clients.",
      "button": "Learn more about us!"
    },
    "services": {
      "title": "Services",
      "body": "Thompson Boiler Works Inc. with our affiliated companies, Ritchie’s Welding and McNolty Mechanical, offer our customers a wide range of versatile welding procedures & metal fabricating. As a full-service welding operation where safety is our top priority, clients receive accurate results from certified welders who follow all trade regulations and practices.",
      "button": "Learn more about our services!",
      "imageAlt": "Transalata Toronto, Ontario – Removal of Generator at Power Plant"
    },
    "projects": {
      "title": "Projects",
      "body": "Thompson Boiler Works is a one-stop-shop for your needs. With the ability to tackle large or small projects when complex welding or outside-the box-thinking is needed.  The team is engaged and strives daily in doing the work correctly, the first time. We have proven time and time again that we work well in time-sensitive situations to meet deadlines and satisfy the need of our customers.",
      "button": "Learn more about our projects!",
      "imageAlt": {
        "one": "Zibi – Ottawa – Description Underground piping welding station",
        "two": "Zibi – Ottawa Manifold Header – Temporary Heating Plant",
        "three": "Ottawa University - Installation of Cooling Tower",
        "four": "Ottawa University – Main Header Cooling Tower"
      }
    }
  },
  "about": {
    "title": "About",
    "section": {
      "one": {
        "body": "Privately owned and operated since 1988. Thompson Boiler Works has come a long way from its beginnings. Originally specializing in commercial industrial boiler making and repairs, we now (over 33 years later) encompass other aspects of the commercial-industrial mechanical field while maintaining the core business of boilers and pressure vessels.",
        "imageAlt": "Cooling Towers Replacement",
        "imageCaption": "Cooling Towers Replacement"
      },
      "two": {
        "body": "Thompson Boiler Works Inc. was built on quality and continues to deliver our high standards. Our core value is our people and our customers. We provide premier service with benchmark levels of safety, turnaround time, and cooperation. While also specializing in finding solutions to complex problems by partnering with our clients. Through teamwork, we complete your projects safely, on time, and within budget.",
        "imageAlt": "Roof Top Heat Exchanger Installation",
        "imageCaption": "Roof Top Heat Exchanger Installation"
      }
    },
    "ourTeam": "Our Team",
    "members": {
      "one": {
        "name": "Eric Thompson (Retired)",
        "subtitle": "Founder, High Pressure welder, Gas technician, Oil Burner Mechanic, Boilermaker",
        "body": "The founder of Thompson Boiler Works in 1988. Working in the field as a high-pressure welder, gas and oil technician and boilermaker until his retirement in 2003, when his son Jason Thompson was appointed President of the company."
      },
      "two": {
        "name": "Jason Thompson",
        "subtitle": "President",
        "body": "Joining the family business in 1989, Jason started as a labourer/apprentice and eventually graduating to a high-pressure welder, pipefitter, and boilermaker. Later appointed to President of Thompson Boiler Works Inc in 2003, Jason continues to maintain the core business of boilers and pressure vessels while encompassing other aspects of the commercial, industrial, and mechanical fields. In 2017, Jason acquired the skills and experience of Ritchies Welding Inc., followed respectively by McNolty Mechanical in 2020. Jason attributes the success of the companies to his many customers, suppliers, and his loyal employees."
      },
      "three": {
        "name": "Martin Vinette",
        "subtitle": "High Pressure welder, Pipe fitter, Boilermaker",
        "body": "Martin has been employed with Thompson Boiler Works since 1997. He is responsible for developing customer relations, scheduling of the field welders/boiler makers, field production for all projects and troubleshooting as needed. His many years of experience working in the field as a High-Pressure Welder-Pipe Fitter-Boilermaker on both large and small projects has made the transition to Director of Operations seamless."
      },
      "four": {
        "name": "Dave Kollesh",
        "subtitle": "High Pressure welder, Pipe fitter, Boilermaker",
        "body": "Dave has been employed with Thompson Boiler Works since 1999. Initially hired as an experience high-pressure welder, pipe fitter, boilermaker, with over 10 years proven experience in the field as a welder. Over the last 15 years Dave’s versatility and ability to adapt to changing environments has gradually transitioned him to his present position as Office Manager/Material Buyer. He manages and oversees the day-to-day administration, accounting, payroll, material buying and customer service."
      },
      "five": {
        "name": "Claude Turpin",
        "subtitle": "Certified Journeyman Plumber, Steamfitter, Pipe fitter, and Petroleum Equipment Mechanic 2 and 3.",
        "body": "Claude joined Thompson Boiler Work in 2018 in the role of Senior Project Manager. He is responsible for identifying and developing new opportunities with clients, processing bid tenders and submitting proposals, coordinating team members to ensure all parties are on track with project requirements, deadlines, and schedules. He also visits job sites to ensure all project requirements are executed as identified in the drawings and specifications, meets with team members to identify and resolve issues, and co-ordinates with internal resources and suppliers for the execution of projects."
      },
      "six": {
        "name": "Maud Simoneau",
        "subtitle": "",
        "body": "Maud joined Thompson Boiler Works in 2018 in the role of Project Manager. Maud has been in the boiler business for many years she brings a wide range of knowledge and experience in this field. She is presently responsible for the planning, troubleshooting, and executing the detail scope of work required for each project. She meets with the project team members to identify and resolve issues. She facilitates change requests to ensure that all parties are advised of the impacts on schedule and budget. Lastly, she manages customer satisfaction within the project during the transition period and conducting post-project evaluation to ensure the success of each project."
      }
    }
  },
  "services": {
    "title": "Services",
    "service": {
      "one": {
        "title": "Rental Boilers",
        "body": "Emergency Temporary boiler plant main steam header fabrication and installation. All piping built and inspected to ASME B31.1 by TSSA (Technical Safety Standards Authority) with 100% X-Ray NDT inspections. Uninterrupted delivery to meet heating season and process demands.",
        "imageAlt": "Rental boilers available from our Ottawa storage facility",
        "imageCaption": "Rental boilers available from our Ottawa storage facility"
      },
      "two": {
        "title": "Industrial Maintenance",
        "body": "Thompson has consistently shown leadership in an industrial market place by providing technical experience, knowledge and power production to its clients.",
        "imageAlt": "Paper manufacturing plant boiler installation",
        "imageCaption": "Paper manufacturing plant boiler installation"
      },
      "three": {
        "title": "Fabrication",
        "body": "Thompson Boiler Works Inc. associated company Ritchie’s Welding has complete piping spool/structural and custom fabrication capabilities for Carbon Steel, Stainless Steel, Alloy’s and Aluminium.  All welding performed at our fabrication facilities is performed to meet or exceed TSSA,ASME & CWB.",
        "imageAlt": "Stairs at Ottawa Construction office",
        "imageCaption": "Stairs at Ottawa Construction office"
      },
      "four": {
        "title": "High Pressure Welding",
        "body": "Thompson has Field Installation / Fabrication capabilities for Carbon Steel, Stainless Steel, Alloy's and Aluminum. All welding performed is done to ASME & CWB qualified welding procedures.",
        "imageAlt": "High pressure welding at government facility",
        "imageCaption": "High pressure welding at government facility"
      }
    }
  },
  "careers": {
    "title": "Careers",
    "flavorText": "At Thompson Boiler Works we are constantly looking for new and passionate employees. If you are interested in a possible position please fill out and attach your resume below!",
    "form": {
      "name": "Name",
      "email": "Email",
      "body": "Body / Cover Letter",
      "upload": "Upload a file",
      "paste": "Copy and Paste",
      "resumeText": "Resume",
      "success": "Application submitted successfully",
      "successUpload": "Resume uploaded successfully",
      "successDelete": "File deleted successfully",
      "failedDelete": "File was not deleted successfully",
      "errorFile": "Error uploading file",
      "incorrectFile": "Invalid file type",
      "invalidFile": "File is invalid",
      "largeFile": "File is too large",
      "fail": "Email failed to send",
      "missingResume": "No resume was provided",
      "dropzoneText": "Upload your resume",
      "dropzoneLabel": "Upload your resume as a pdf, and ensure it's less than 500 kb."
    }
  },
  "projects": {
    "title": "Projects",
    "flavorText": "Customized solutions to your most challenging projects",
    "project": {
      "one": {
        "title": "Zibi",
        "body": "TBW has been part of the ZIBI development for the last 4 years. In working with the Eddy Lands Projects team (Ed Brunet and Ledcor), we have been part of the team that installed their infrastructure program for the District Thermal system. This system will provide the necessary energy requirements to the mix usage development plan with LTHW (Low Temperature Hot Water), HTHW (Hot Temperature Hot Water) and CHW (Chilled Water). These networks of pipes are being linked between Ontario and Quebec under the Union Bridge and underground through Booth St and other surrounding streets.",
        "imageAlt": "Zibi - Ottawa – Bridge connection from power plant to building connecting Ontario and Quebec."
      },
      "two": {
        "title": "Strathcona",
        "body": "Installation of a new saturated steam boiler 80,000 lbs/hr. the scope of work required dismantling of the old boiler, rigging new boiler inside the steam plant, installing the new boiler with all accessories which included economizer, FD fan, piping for all services, heat exchanger, controls, and electricals.",
        "imageAlt": "Strathcona-Ontario – Installation PRV station on steam line"
      },
      "three": {
        "title": "Kirkland Lake",
        "body": "Removal and Replacement of Economizer of a Heat Recovery Steam Generator (HRSG) at North Power Station in Kirkland Lake, the weigh of the Replacement Economizer is 80,000 lbs. For this removal and installation of the Economizer a mobile crane with counterweights (500-ton Super Max) was required. The new Economizer arrived in a horizontal position on site with a lifted bed. The procedure for lifting the Economizer from horizontal position to vertical position required two mobile cranes with a rigging procedure in place, using a 550-ton super Max crane with a 90-ton crane.",
        "imageAlt": "Kirkland Lake Power Plant – Removal of old Heat Exchanger"
      },
      "four": {
        "title": "Queenway Carleton Hospital",
        "body": "Retubing of High Pressure Firetube Boiler used for heating and processing sanitation",
        "imageAlt": "Front View of 600 HP Fire Tube Boiler ready for retubing at Ottawa Hospital Facility."
      },
      "five": {
        "title": "Ottawa University",
        "body": "Installation at the University of Ottawa (Central Heating and cooling plant). All associated supply and return piping was 10,12,16” Stainless Steel piping and fiberglass. Extensive heavy lift/rigging/offsite fabrication and commissioning.",
        "imageAlt": "Cooling tower replacement at University of Ottawa"
      }
    }
  },
  "footer": {
    "connectList": {
      "title": "Connect",
      "address": "5678 Power Rd South",
      "phone": "(613) 822-4099"
    },
    "linksList": {
      "title": "Links"
    },
    "hoursList": {
      "title": "Hours Of Operation",
      "weekdays": "Monday - Friday",
      "weekdayTimes": "7:00 am – 4:30 pm",
      "allHourService": "On call service available 24 hours a day, 7 days a week"
    },
    "imageAlt": "thompson boiler works logo"
  },
  "contact": {
    "form": {
      "tagline": "Send us an email!",
      "name": "Name",
      "email": "Email",
      "subject": "Subject",
      "body": "Body",
      "button": "Submit",
      "success": "Email sent successfully",
      "badInput": "Invalid form input",
      "fail": "Email failed to send"
    },
    "info": {
      "company": "Thompson Boiler Works",
      "address": "5678 Power Rd South",
      "city-province": "Glouceseter, ON",
      "country": "Canada",
      "postal-code": "K1G 3N4",
      "phone": "(613) 822-4099"
    }
  },
  "formValidation": {
    "required": {
      "name": "Name is required",
      "email": "Email is required",
      "subject": "Subject is required",
      "body": "Body is required",
      "resumeText": "Resume is required"
    },
    "length": {
      "name": "Name should be under 50 characters",
      "subject": "Subject should be under 80 characters",
      "body": "Body should be under 500 characters",
      "resumeText": "Resume should be under 1000 characters"
    },
    "invalid": {
      "email": "Please enter a valid email"
    }
  }
}
